

<h1 align="center">
    NSDC Data Science Projects
</h1>

<h2 align="center">
    Project: Intermediate SQL Queries - #2
</h2>

<h3 align="center">
    Name: HANG TRAN
</h3>

**Project Description:**

To work with the New York City Airbnb dataset in this project, you'll need to create and connect to an SQLite database as seen in the steps within this notebook.

**Key Features**

- Practical SQL exercises with step-by-step instructions.
- Real-world datasets for hands-on experience.
- Comprehensive explanations of SQL queries and concepts.
- Interactive coding examples and challenges.

**Dataset**
- You can find the New York City Airbnb dataset on Kaggle: [New York City Airbnb Dataset](https://www.kaggle.com/datasets/dgomonov/new-york-city-airbnb-open-data)
- Download the dataset from the provided link and save it as 'AB_NYC_2019.csv' on your computer.
- On colab, click on the "Upload" button and select the 'AB_NYC_2019.csv' file from your local computer.

## Introduction
This SQL project is designed for those who want to practice writing SQL queries using a real-world dataset. In this project, we will work with the New York City Airbnb dataset. The main goal is to practice SQL syntax and intermediate data analysis tasks. Make sure to complete the code where there is a 'TODO' sign. Hints are provided along the way.

## Table of Contents
1. [Libraries and Database Setup](#database-setup)
2. [Loading the Dataset](#loading-dataset)
3. [SQL Queries](#sql-queries)
4. [Closing Connection](#closing-connection)
5. [Summary of Intermediate SQL Commands](#summary-commands)

# Section 1: Libraries and Database Setup <a name="database-setup"></a>

### Task 1.1: Import Libraries
Let's start by importing the necessary libraries.

In [1]:
# Connect to Google Drive
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [2]:
import pandas as pd
import numpy as np
import sqlite3

### Task 1.2: Connect to the Database

Next, establish a connection to the SQLite database named 'airbnb.db'.
Use the sqlite3 library to create a connection object and store it in a variable called 'conn'.

In [3]:
# Completed

# Connect to the SQLite database
conn = sqlite3.connect('airbnb.db')
cursor = conn.cursor()

# Section 2: Loading the Dataset <a name="loading-dataset"></a>

### Task 2.1: Load the Dataset
- You will work with the 'listings' table from the New York City Airbnb dataset.
- Load the dataset from the CSV file 'AB_NYC_2019.csv' into a DataFrame named 'df'.
- Then, import the DataFrame into the 'listings' table in the database using the to_sql() method.

\\

Hint: Use the read_csv() method from pandas to read the CSV file.

In [4]:
# Completed

# Load the dataset into the SQLite database
data_path = 'AB_NYC_2019.csv'
df = pd.read_csv(data_path)
df.to_sql('listings', conn, if_exists='replace', index=False)

48895

# Section 3: Intermediate SQL Tasks <a name="sql-queries"></a>

Query the database: Write SQL queries to analyze the data in the SQLite database. You can use the sqlite3 library to execute the queries and fetch the results.

### Task 3.1: Using Subquery for Aggregation
- Find listings with a price greater than or equal to the maximum price of entire home/apartment listings.

In [7]:
# TODO: Complete the query by adding the SELECT, WHERE, and LIMIT statement

query = """

-- Select specific columns (id, name, neighbourhood_group, price) from listings
-- insert SELECT statement here
SELECT id, name, neighbourhood_group, price
FROM listings

-- where the price is greater than or equal to the maximum price among entire home/apartment listings
-- insert WHERE statement here
WHERE price >= (
  SELECT MAX(price)
  FROM listings
  WHERE room_type = 'Entire home/apt'
)

-- Limit the results to display only the top 5 listings
-- add the LIMIT
LIMIT 5
"""

In [9]:
# Completed

result = pd.read_sql_query(query, conn)
print("\nExample 2 - Using Subquery for Aggregation:")
print(result)

Example 2 - Using Subquery for Aggregation:
         id                                             name  \
0   7003697              Furnished room in Astoria apartment
1  13894339  Luxury 1 bedroom apt. -stunning Manhattan views
2  22436899                              1-BR Lincoln Center

  neighbourhood_group  price
0              Queens  10000
1            Brooklyn  10000
2           Manhattan  10000

### Task 3.2: Using CTE for Clarity
- Create a [Common Table Expression (CTE)](https://learnsql.com/blog/what-is-common-table-expression/) for high-priced listings and retrieve details.

In [14]:
# TODO: Complete the query by first finishing the CTE query  by adding the WHERE statement. Then complete the following SELECT AND FROM statements.

query = """

-- Create a common table expression (CTE) to select high-priced listings greater than 500
WITH high_price_listings AS (
    SELECT *
    FROM listings
    -- insert WHERE the price is greater than 500
    WHERE price > 500
)

-- Select specific columns (id, name, neighbourhood_group, price) from high-priced listings
-- insert SELECT statement
-- insert FROM statement
SELECT id, name, neighbourhood_group, price
FROM high_price_listings
-- Limit the results to display only the top 5 listings
LIMIT 5
"""

In [15]:
# Completed

result = pd.read_sql_query(query, conn)
print("\nExample 3 - Using CTE for Clarity:")
print(result)

Example 3 - Using CTE for Clarity:
       id                                   name neighbourhood_group  price
0   19601    perfect for a family or small group            Brooklyn    800
1   68974     Unique spacious loft on the Bowery           Manhattan    575
2   89427                   The Brooklyn Waverly            Brooklyn    650
3  103311      2 BR w/ Terrace @ Box House Hotel            Brooklyn    599
4  174966  Luxury 2Bed/2.5Bath Central Park View           Manhattan   2000

### Task 3.3: Using GROUP BY and HAVING
-  Count the number of listings in each neighbourhood_group with more than 1000 listings.

In [16]:
# TODO: Complete the GROUP_BY and the HAVING COUNT statement to 1000 listings

query = """
SELECT neighbourhood_group, COUNT(*) AS num_listings
FROM listings
-- insert GROUP_BY statement
-- insert HAVING COUNT statement
GROUP BY neighbourhood_group
HAVING COUNT(*) > 1000
"""

In [17]:
# Completed

result = pd.read_sql_query(query, conn)
print("\nExample 4 - Using GROUP BY and HAVING:")
print(result)

Example 4 - Using GROUP BY and HAVING:
  neighbourhood_group  num_listings
0               Bronx          1091
1            Brooklyn         20104
2           Manhattan         21661
3              Queens          5666

### Task 3.4: Using [CASE Statements](https://www.w3schools.com/sql/sql_case.asp)
- Calculate the count of listings in each neighborhood group categorized into three price ranges: cheap, moderate, and expensive.

In [18]:
# TODO: Complete the third case switch statement for expensive_listings and insert GROUP BY statement

query = """

-- Select the neighborhood_group and use conditional aggregation to count listings in price ranges
SELECT neighbourhood_group,
       SUM(CASE WHEN price <= 100 THEN 1 ELSE 0 END) AS cheap_listings,
       SUM(CASE WHEN price > 100 AND price <= 200 THEN 1 ELSE 0 END) AS moderate_listings,
       -- insert SUM WHEN price > 200 THEN 1 ELSE 0 and label AS expensive_listings
       SUM(CASE WHEN price > 200 THEN 1 ELSE 0 END) AS expensive_listings
FROM listings

-- Group the data by neighborhood_group to get counts for each group
-- insert GROUP BY statement
GROUP BY neighbourhood_group
"""

In [19]:
# Completed

result = pd.read_sql_query(query, conn)
print("\nExample 5 - Using CASE Statements:")
print(result)

Example 5 - Using CASE Statements:
  neighbourhood_group  cheap_listings  moderate_listings  expensive_listings
0               Bronx             865                181                  45
1            Brooklyn           11771               6278                2055
2           Manhattan            6921               8803                5937
3              Queens            4101               1243                 322
4       Staten Island             270                 78                  25

### Task 3.5: Using [Self-Join](https://www.w3schools.com/sql/sql_join_self.asp) for Data Comparison
- Compare the average price of each neighborhood's listings with the overall average price, highlighting neighborhoods with prices higher than the overall average.

In [20]:
# TODO: Complete the CTE WITH statement, insert SELECT statement, and insert the self-inner join (becareful with parenthesis grouping -- there are two AS assignments)

query = """
-- Create a common table expression (CTE) to calculate the average prices for each neighborhood

-- insert WITH statement
WITH avg_prices AS (
    SELECT neighbourhood, AVG(price) AS avg_price
    FROM listings
    GROUP BY neighbourhood
)

-- Select the neighborhood, its average price, and the overall average price
-- insert SELECT statement of columns with their associated table name
SELECT a.neighbourhood, a.avg_price, b.avg_price AS overall_avg
FROM avg_prices AS a

-- Self-join with a subquery to retrieve the overall average price
-- insert INNER JOIN of the AVG(price) save AS avg_price FROM listings and then save it all AS b
INNER JOIN (SELECT AVG(price) AS avg_price FROM listings) AS b

-- Filter for neighborhoods with average prices higher than the overall average
WHERE a.avg_price > b.avg_price
"""

In [21]:
# Completed

result = pd.read_sql_query(query, conn)
print("Example 7 - Using Self-Join for Data Comparison:")
print(result)

Example 7 - Using Self-Join for Data Comparison:
         neighbourhood   avg_price  overall_avg
0              Arverne  171.779221   152.720687
1    Battery Park City  367.557143   152.720687
2              Bayside  157.948718   152.720687
3         Belle Harbor  171.500000   152.720687
4          Boerum Hill  176.135593   152.720687
5         Breezy Point  213.333333   152.720687
6     Brooklyn Heights  209.064935   152.720687
7      Carroll Gardens  175.914163   152.720687
8              Chelsea  249.738544   152.720687
9            Chinatown  161.497283   152.720687
10         City Island  173.000000   152.720687
11        Civic Center  191.942308   152.720687
12        Clinton Hill  181.893357   152.720687
13         Cobble Hill  211.929293   152.720687
14         Columbia St  162.952381   152.720687
15               DUMBO  196.305556   152.720687
16        East Village  186.083108   152.720687
17        Far Rockaway  165.862069   152.720687
18  Financial District  225.490591   152.720687
19   Flatiron District  341.925000   152.720687
20      Fort Wadsworth  800.000000   152.720687
21             Gowanus  158.801619   152.720687
22            Gramercy  222.754438   152.720687
23   Greenwich Village  263.405612   152.720687
24         Grymes Hill  159.142857   152.720687
25      Hell's Kitchen  204.794178   152.720687
26     Jamaica Estates  182.947368   152.720687
27            Kips Bay  202.408511   152.720687
28     Lighthouse Hill  157.500000   152.720687
29        Little Italy  222.066116   152.720687
30     Lower East Side  186.312843   152.720687
31             Midtown  282.719094   152.720687
32          Mill Basin  179.750000   152.720687
33         Murray Hill  220.958763   152.720687
34            Neponsit  274.666667   152.720687
35                NoHo  295.717949   152.720687
36              Nolita  230.138340   152.720687
37          Park Slope  176.312253   152.720687
38        Prince's Bay  409.500000   152.720687
39    Prospect Heights  173.372549   152.720687
40       Randall Manor  336.000000   152.720687
41           Riverdale  442.090909   152.720687
42            Sea Gate  487.857143   152.720687
43                SoHo  287.103352   152.720687
44      Spuyten Duyvil  154.750000   152.720687
45     Stuyvesant Town  169.108108   152.720687
46    Theater District  248.013889   152.720687
47           Todt Hill  169.000000   152.720687
48             Tribeca  490.638418   152.720687
49     Upper East Side  188.948276   152.720687
50     Upper West Side  210.918316   152.720687
51        Vinegar Hill  187.176471   152.720687
52        West Village  267.682292   152.720687
53         Willowbrook  249.000000   152.720687
54             Woodrow  700.000000   152.720687

# Section 4: Closing the Database Connection <a name="closing-connection"></a>

### Task 4.1: Close the Cursor and Database Connection
- It's good practice to close the cursor and the database connection when you're done working with the database to free up system resources and maintain proper connection management.

In [22]:
# Completed

# Make sure to include these lines of code at the end of your script to properly close the cursor and database connection.
cursor.close()
conn.close()

# Section 5: Summary of Basic SQL Commands <a name="summary-commands"></a>

In this project, you have practiced various SQL commands and tasks. Below is a summary of the basic SQL commands used:

**Task 1.2: Connect to the Database**
- Established a connection to the SQLite database.

**Task 2.1: Load the Dataset**
- Loaded the dataset into a DataFrame.
- Imported the DataFrame into the database.

**Task 3.1: Using Subquery for Aggregation**
- SQL Commands: SELECT, FROM, WHERE, Subquery, MAX(), LIMIT
- Description: Find listings with a price greater than or equal to the maximum price of entire home/apartment listings.

**Task 3.2: Using CTE for Clarity**
- SQL Commands: WITH, Common Table Expression (CTE), SELECT, FROM, LIMIT
- Description: Create a Common Table Expression (CTE) for high-priced listings and retrieve details.

**Task 3.3: Using GROUP BY and HAVING**
- SQL Commands: SELECT, COUNT(), AS, FROM, GROUP BY, HAVING
- Description: Count the number of listings in each neighbourhood_group with more than 1000 listings.

**Task 3.4: Using CASE Statements**
- SQL Commands: SELECT, SUM(), CASE, WHEN, THEN, ELSE, END, AS, FROM, GROUP BY
- Description: Calculate the count of listings in each neighborhood group categorized into three price ranges: cheap, moderate, and expensive.

**Task 3.5: Using Self-Join for Data Comparison**
- SQL Commands: WITH, Common Table Expression (CTE), SELECT, AVG(), AS, INNER JOIN, ON, Self-Join, WHERE
- Description: Compare the average price of each neighborhood's listings with the overall average price, highlighting neighborhoods with prices higher than the overall average.

**Task 4.1: Close the Cursor and Database Connection**
- Closed the cursor and the database connection.

This summary provides an overview of the intermediate SQL commands used in this project. You can use this as a reference for future SQL projects and data analysis tasks.

# Section 6: Summary of Key Insighs <a name="summary-insights"></a>

Key Insights from NYC Airbnb Analysis:

- Most Expensive Listings: Identified the top 5 most expensive Airbnb listings across New York City, especially among entire homes/apartments, revealing luxury rental trends.

- Popular Neighborhoods: Found that Manhattan and Brooklyn dominate in both the number of listings and average prices, with neighborhoods like Williamsburg and Harlem being particularly active.

- Price Distribution: A significant portion of listings are under 100 per night, but there is a long lists of luxury properties with prices significantly above 500

- Room Type Trends: Entire homes/apartments account for the highest average prices, while private rooms are far more common and affordable.

- Host Activity: Some hosts manage dozens of listings, indicating the presence of commercial hosting operations beyond individual rentals.